# GetLightLocation

## Description
Procedure GetLightLocation returns the position of the referenced light object.

```pascal
PROCEDURE GetLightLocation(
				h            : HANDLE;
				VAR pX,pY,pZ : REAL);
```

```python
def vs.GetLightLocation(h):
    return p
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to light.|
|p|REAL|Returns coordinate location of light.|

## Version
Availability: from MiniCAD7.0

## Category
* Objects - Lights